# 5.1 Pandas Ex - GroupBy

In [1]:
import pandas as pd

1. Encontre os valores médio, mínimo e máximo do grupo de valor da compra (purch_amt) por ID do cliente (customer_id) do DataFrame1. <br>
DataFrame1:<br>
pd.DataFrame({<br>
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],<br>
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],<br>
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],<br>
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],<br>
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})<br>

In [14]:
df1 = pd.DataFrame({
'ord_no':[70001,70009,70002,70004,70007,70005,70008,70010,70003,70012,70011,70013],
'purch_amt':[150.5,270.65,65.26,110.5,948.5,2400.6,5760,1983.43,2480.4,250.45, 75.29,3045.6],
'ord_date': ['2012-10-05','2012-09-10','2012-10-05','2012-08-17','2012-09-10','2012-07-27','2012-09-10','2012-10-10','2012-10-10','2012-06-27','2012-08-17','2012-04-25'],
'customer_id':[3005,3001,3002,3009,3005,3007,3002,3004,3009,3008,3003,3002],
'salesman_id': [5002,5005,5001,5003,5002,5001,5001,5006,5003,5002,5007,5001]})
print(df1)
result = df1.groupby('customer_id').agg({'purch_amt':['mean','min','max']})
print(result)

    ord_no  purch_amt    ord_date  customer_id  salesman_id
0    70001     150.50  2012-10-05         3005         5002
1    70009     270.65  2012-09-10         3001         5005
2    70002      65.26  2012-10-05         3002         5001
3    70004     110.50  2012-08-17         3009         5003
4    70007     948.50  2012-09-10         3005         5002
5    70005    2400.60  2012-07-27         3007         5001
6    70008    5760.00  2012-09-10         3002         5001
7    70010    1983.43  2012-10-10         3004         5006
8    70003    2480.40  2012-10-10         3009         5003
9    70012     250.45  2012-06-27         3008         5002
10   70011      75.29  2012-08-17         3003         5007
11   70013    3045.60  2012-04-25         3002         5001
               purch_amt
                    mean      min      max
customer_id
3001          270.650000   270.65   270.65
3002         2956.953333    65.26  5760.00
3003           75.290000    75.29    75.29
3004         1983.430000  1983.43  1983.43
3005          549.500000   150.50   948.50
3007         2400.600000  2400.60  2400.60
3008          250.450000   250.45   250.45
3009         1295.450000   110.50  2480.40

2. Agrupe o Dataframe1 pelas colunas salesman_id e customer_id e conte as ocorrências de cada linha.

In [9]:
result = df1.groupby(['salesman_id','customer_id']).size().reset_index().groupby(['salesman_id','customer_id'])[[0]].max()
result

                         0
salesman_id customer_id
5001        3002         3
            3007         1
5002        3005         2
            3008         1
5003        3009         2
5005        3001         1
5006        3004         1
5007        3003         1

In [11]:
df1.groupby(['salesman_id','customer_id'])['purch_amt'].count()

salesman_id  customer_id
5001         3002           3
             3007           1
5002         3005           2
             3008           1
5003         3009           2
5005         3001           1
5006         3004           1
5007         3003           1
Name: purch_amt, dtype: int64

3. Agrupe o DataFrame1 por 'customer_id', 'salesman_id' e calcule a soma de purch_amt.

In [15]:
df1_agg = df1.groupby(['customer_id','salesman_id']).agg({'purch_amt': sum})
df1_agg

                         purch_amt
customer_id salesman_id
3001        5005            270.65
3002        5001           8870.86
3003        5007             75.29
3004        5006           1983.43
3005        5002           1099.00
3007        5001           2400.60
3008        5002            250.45
3009        5003           2590.90

4. Agrupe o DataFrame1 com base no ID do cliente e crie uma lista de datas de pedido para cada grupo.

In [16]:
result = df1.groupby('customer_id')['ord_date'].apply(list)
print(result)

customer_id
3001                            [2012-09-10]
3002    [2012-10-05, 2012-09-10, 2012-04-25]
3003                            [2012-08-17]
3004                            [2012-10-10]
3005                [2012-10-05, 2012-09-10]
3007                            [2012-07-27]
3008                            [2012-06-27]
3009                [2012-08-17, 2012-10-10]
Name: ord_date, dtype: object

5. Agrupe o DataFrame1 para calcular o valor da compra mensal.

In [17]:
df1['ord_date'] = pd.to_datetime(df1['ord_date'])
result = df1.set_index('ord_date').groupby(pd.Grouper(freq='M')).agg({'purch_amt':sum})
print(result)

            purch_amt
ord_date
2012-04-30    3045.60
2012-05-31       0.00
2012-06-30     250.45
2012-07-31    2400.60
2012-08-31     185.79
2012-09-30    6979.15
2012-10-31    4679.59

6. Agrupe o DataFrame1 por mês e ano com base na data do pedido e encontre o valor total da compra por ano, por mês.

In [18]:
result = df1.groupby([df1['ord_date'].dt.year, df1['ord_date'].dt.month]).agg({'purch_amt':sum})
print(result)

                   purch_amt
ord_date ord_date
2012     4           3045.60
         6            250.45
         7           2400.60
         8            185.79
         9           6979.15
         10          4679.59